---
kind: other
id: Methods.T:Autodesk.Revit.DB.FaceSplitter
source: html/8fd45210-0511-336b-1413-5abb262620ce.htm
---
# FaceSplitter Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.